app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
 def competition
     @users = User.all

INSERT INTO "users" ("created_at", "email", "first_name", "last_name", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save_with_captcha